export default {
  // 中文字符
  Chinese: /[\u4e00-\u9fa5]/,
  // 中国大陆手机号 (移动/联通/电信)
  Phone: /^1(3[0-9]|4[57]|5[0-35-9]|7[0135678]|8[0-9]|9[8-9])\d{8}$/,
  // 邮箱
  Email: /[\w!#$%&'*+/=?^_`{|}~-]+(?:\.[\w!#$%&'*+/=?^_`{|}~-]+)*@(?:[\w](?:[\w-]*[\w])?\.)+[\w](?:[\w-]*[\w])?/,
  // 统一资源标识符
  URI: /[a-zA-z]+:\/\/[^\s]*/,
  // 统一资源定位符
  URL: /https?:\/\/[^\s]*/,
  // QQ号码
  QQ: /[1-9][0-9]{4,}/,
  // 邮政编码
  PostalCode: /[1-9]\d{5}(?!\d)/,
  // 身份证
  IDCard: /^(\d{6})(\d{4})(\d{2})(\d{2})(\d{3})([0-9]|X)$/,
  // 整数
  Integer: /^-?[1-9]\d*$/,
  // 正整数
  PositiveInteger: /^[1-9]\d*$/,
  // 负整数
  NegtiveInteger: /^-[1-9]\d*$/,
  // 非正整数
  NonPositiveInteger: /^-[1-9]\d*|0$/,
  // 非负整数
  NonNegtiveInteger: /^[1-9]\d*|0$/,
};
